<meta HTTP-EQUIV="content-type" CONTENT="text/html; charset=UTF-8">
<html>
<head>
  <title>Ventana Ataques</title>
</head>
<body>

<h1>Ventana Ataques</h1>
<p></p>
<p>El proceso de simulaci&#243;n de ataques est&#225; claramente diferenciado en
tres sencillos pasos. <br></p>
<br>
<p><img style="border-width: 0px;" src="resources/botondef1.png" width="30" height="29" /> <u> Funcionamiento.</u> <br>
Aqu&#237; se presentan dos modos de funcionamiento principales: <b>Servidor</b> y <b>Cliente</b><br></p>
<img style="border-width: 0px;" src="resources/Imagen19.png" width="479" height="120" />

<p>Al elegir el modo Servidor podemos observar que todas las opciones y campos de la pantalla se habilitar&#225;n, ya que son necesarios para su ejecuci&#243;n. En este apartado en particular deberemos introducir el n&#250;mero de clientes que van a conectarse a nuestro servidor, que ser&#225; con los que se comunicar&#225; para llevar a cabo el ataque, y el modo de cifrado. En caso de que queramos hacer el ataque con un solo ordenador, se dispone de la opci&#243;n monousuario, en la que no habr&#225; que ofrecer ninguna informaci&#243;n sobre la conexi&#243;n. Esta opci&#243;n nos permite elegir la manera en la que el texto en claro ser&#225; tratado en la aplicaci&#243;n una vez se divida en bloques. Estos dos m&#233;todos son el ECB (<i>Electronic CodeBook</i> - Libro de c&#243;digo electr&#243;nico) y CBC (<i>Cipher-Block Chaining</i> - Cifrador de Bloques en Cadena). Al elegir el modo CBC, cuando pulsemos el bot&#243;n &quot;Ejecutar&quot; nos aparecer&#225; una ventana pidi&#233;ndonos que introduzcamos el vector de incializaci&#243;n, que es un vector de 16 bytes (32 d&#237;gitos hexadecimales) necesario para llevar a cabo este m&#233;todo.</p>
<p>Si elegimos el modo Cliente, tan s&#243;lo debemos introducir la IP del servidor al cual nos queremos conectar para realizar el ataque. En caso de que &#233;sta fuese incorrecta o no se encontrase, el programa nos avisar&#237;a de ello, no dej&#225;ndonos continuar.</p>

<p><img style="border-width: 0px;" src="resources/botondef2.png" width="30" height="29" /><u> Entrada.</u><br>
Una vez seleccionado el modo de funcionamiento, si hemos elegido actuar como servidor, tendremos que rellenar esta secci&#243;n. Podemos observar que hay que introducir dos cosas distintas: el <b>texto en claro</b> y el <b>texto cifrado</b>.</p> 
<p>En el <u>texto en claro</u> debemos introducir el texto o archivo antes de ser cifrado, y puede rellenarse con tres formatos distintos, que se configuran en la caja de selecci&#243;n que se encuentra sobre dicha &#225;rea de texto: <b>Texto ASCII</b>, <b>Hexadecimal</b> y <b>Archivo</b>.</p> 
<img style="border-width: 0px;" src="resources/Imagen21.png" width="311" height="180" />

<p>El texto ASCII permite la introducci&#243;n de un texto est&#225;ndar de hasta 1024 caracteres, el hexadecimal permite la introducci&#243;n de una ristra de hasta 2048 d&#237;gitos hexadecimales, y el archivo habilita el bot&#243;n &quot;Buscar&quot;. A trav&#233;s de este bot&#243;n accedemos a una ventana donde se nos permite elegir el archivo sin cifrar, de hasta un tama&#241;o de 40MB, que queremos utilizar.</p>
<p>Por otra parte, en el <u>texto cifrado</u> debemos introducir el texto o archivo despu&#233;s de ser cifrado por la aplicaci&#243;n. Al igual que en el texto en claro tiene tres opciones de formato: <b>Base64</b>, <b>Hexadecimal</b> y <b>Archivo</b>. </p>

<img style="border-width: 0px;" src="resources/Imagen20.png" width="311" height="180" />

<p>Base64 es una forma de codificaci&#243;n de cualquier cantidad de bits que permite representarlos en caracteres imprimibles, y se permite la entrada en el programa de hasta 1388 caracteres en Base64. Para hexadecimal se permite introducir hasta 2080 d&#237;gitos hexadecimales, y la opci&#243;n archivo habilita el bot&#243;n buscar, que como en el texto en claro nos llevar&#225; a una ventana donde seleccionar el archivo, en este caso cifrado, que queremos utilizar. Recordamos que dicho archivo puede ser como m&#225;ximo de 40 MB.</p>

<p><img style="border-width: 0px;" src="resources/botondef3.png" width="30" height="29" /><u> Espacio de claves.</u> <br>
Por &#250;ltimo, deberemos introducir la clave inicial y final que usaremos para realizar la b&#250;squeda de la clave entre ambos valores.<br>
<p> <img style="border-width: 0px;" src="resources/Imagen22.png" width="669" height="115" />
 </p>
<p>Aqu&#237; disponemos de varias opciones de formato en el que introducir dichas claves. En la caja de la derecha podemos seleccionar el tama&#241;o de la clave, que ser&#225; de 128, 192 o 256 bits. Resaltar que con claves m&#225;s grandes el proceso de prueba de claves requerir&#225; m&#225;s tiempo. En cuanto a la caja de la izquierda, nos permite elegir si introduciremos la clave en <b>ASCII</b> o <b>Hexadecimal</b><br>
En caso de que hayamos seleccionado ASCII, deberemos introducir 16, 24 &#243; 32 caracteres est&#225;ndar (para un tama&#241;o de clave de 128, 192 &#243; 256 bits respectivamente).
Si hemos seleccionado hexadecimal, deberemos introducir 32, 48, &#243; 64 d&#237;gitos hexadecimales (para un tama&#241;o de clave de 128, 192 &#243; 256 bits respectivamente).</p>

<p>Desde el men&#250; &quot;Archivo&quot; podremos salir de esta ventana, y desde el men&#250; &quot;Editar&quot; podremos copiar y pegar los campos que necesitemos.</p>

<p>Pulsando el bot&#243;n &quot;Ejecutar&quot; lanzaremos la ejecuci&#243;n del servidor o el cliente, seg&#250;n hayamos elegido. Si los datos han sido introducidos correctamente, aparecer&#225; una ventana en la que se podr&#225; ir siguiendo el estado de la conexi&#243;n y el proceso en general. Para una descripci&#243;n detallada de los diferentes mensajes y su significado, pulsa <a href ="mensajes_comunicacion_ES.html">aqu&#237;</a></p>

<p>La aplicaci&#243;n comprobar&#225; que se est&#225;n introduciendo datos correctos en cada campo de la pantalla, avisando al usuario en caso de que tenga que rellenar alguno de ellos o sea incorrecto. </p>

<p> Mediante el bot&#243;n &quot;Cancelar&quot; volveremos a la pantalla principal de la aplicaci&#243;n.</p>

<p>Informaci&#243;n relacionada: <br>
<a href="principal_ES.html">Cifrado</a>,<a href="secundaria_ES.html">Descifrado</a>, <a href="AddRoundKey_ES.html"> AddRoundKey</a>, <a href="MixColumns_ES.html">MixColumns</a>, <a href="ShiftRows_ES.html">ShiftRows</a>, <a href="SubBytes_ES.html">SubBytes</a>, <a href="mensajes_comunicacion_ES.html">Descripci&#243;n de mensajes del proceso de la comunicaci&#243;n cliente/servidor</a>, <a href="base64_ES.html">Base64</a>, <a href="ecb_ES.html">ECB</a>, <a href="cbc_ES.html">CBC</a>, <a href="Relleno_ES.html">Relleno</a>.



 </p>
</body>
</html>
