<meta HTTP-EQUIV="content-type" CONTENT="text/html; charset=UTF-8">
<html>


<head>


  <title>Proceso de Descifrado</title>
</head>
<body>

<h1>Proceso de Descifrado mediante AESphere</h1>
<p></p>
<p>El proceso de descifrado est&#225; claramente diferenciado en
tres sencillos pasos. <br>
<br>
<img style="border-width: 0px;" src="resources/botondef1.png" width="30" height="29" /><u>Entrada y clave.</u> <br>
A la hora de elegir la entrada tenemos tres posibilidades: <b>base64</b>, <b>Hexadecimal</b> y <b>Archivo</b><br><br>
<img style="border-width: 0px;" src="resources/Imagen24.png" width="275" height="168" />
<br><br>

- Si elegimos la opci&#243;n de base64 se habilita el &#225;rea de texto para introducir como entrada un texto cifrado. Este texto debe ser obligatoriamente la salida del proceso de cifrado, ya que el programa se encargar&#225; de comprobarlo y, en caso de no ser un texto cifrado, el programa lo detectar&#225; e informar&#225; de ello. <br>
- Esta misma comprobaci&#243;n se realiza cuando la entrada es en hexadecimal o en archivo. Eligiendo hexadecimal, la aplicaci&#243;n s&#243;lo permitir&#225; introducir caracteres de este tipo y eligiendo la opci&#243;n &quot;Archivo&quot;, se habilitar&#225; un bot&#243;n para buscar un archivo cifrado, o bien un archivo de texto que contenga un texto cifrado.<br><br>
<img style="border-width: 0px;" src="resources/Imagen2.png" width="255" height="168" />
<br><br>
En cuanto a la clave, tambi&#233;n nos encontramos ante tres posibilidades, <b>Texto ASCII</b>, <b>Hexadecimal</b> y <b>Archivo (base64)</b>.<br>
Hemos de elegir el tama&#241;o que tendr&#225; nuestra clave: 128, 192 &#243; 256 bits. Este tama&#241;o provocar&#225; que el proceso de descifrado tenga m&#225;s o menos rondas: 10, 12 &#243; 14 respectivamente. <br>
Obviamente, si deseamos que el descifrado d&#233; el resultado esperado, debemos elegir la misma clave que usamos a la hora de realizar el cifrado (la aplicaci&#243;n no permitir&#225; itroducir claves superiores del tama&#241;o elegido).</p>

<p><img style="border-width: 0px;" src="resources/botondef2.png" width="30" height="29" /> <u>Salida.</u><br>
Una vez elegida la entrada y la clave, tendremos que elegir el formato de nuestra salida del descifrado.<br>
La salida puede ser igualmente <b>ASCII</b>, <b>Hexadecimal</b> y <b>Archivo</b>. De la elecci&#243;n del usuario depender&#225; el formato que el programa dar&#225; a la salida. La opci&#243;n &quot;Archivo&quot; habilita un campo de texto para escribir la ruta de nuestro archivo descifrado y un bot&#243;n por si lo que se desea es buscar la ruta y escribir el nombre del nuevo archivo. </p>
<p><img style="border-width: 0px;" src="resources/Imagen25.png" width="244" height="114" /></p>
<p><img style="border-width: 0px;" src="resources/botondef3.png" width="30" height="29" /><u>Opciones Avanzadas.</u> <br>
Por &#250;ltimo, deberemos elegir el m&#233;todo de cifrado y el modo de ejecuci&#243;n.<br><br><img style="border-width: 0px;" src="resources/Imagen4.png" width="356" height="132" /> <br><br>
En el m&#233;todo de cifrado (al igual que en el caso de la clave), debemos elegir la misma opci&#243;n que elegimos en el cifrado, ya que si no, el resultado no ser&#237;a el esperado. Eligiendo el m&#233;todo CBC, se habilita el check de introducir manualmente el IV (Vector de Inicializaci&#243;n), el cual deber&#225; introducirse manualmente para que el proceso se complete satisfactoriamente. </p>

<p>Desde el men&#250; &quot;Archivo&quot; podremos cargar y guardar claves, y desde el men&#250; &quot;Editar&quot; podremos copiar y pegar los campos que necesitemos.</p>
<p><img style="border-width: 0px;" src="resources/Imagen7.png" width="255" height="135" /></p>


<p>La aplicaci&#243;n comprobar&#225; que se est&#225;n introduciendo todos los campos obligatorios para pasar al siguiente paso e informar&#225; al usuario en caso de que alguno haya sido introducido incorrectamente </p>

<p> Mediante el bot&#243;n &quot;Cancelar&quot; volveremos a la pantalla principal de la aplicaci&#243;n</p>


<p>Para una informaci&#243;n m&#225;s detallada y te&#243;rica de este proceso consulte los siguientes t&#233;rminos: <br>
<a href="secundaria_ES.html">Descifrado</a>,<a href="principal_ES.html">Cifrado</a>, <a href="AddRoundKey_ES.html"> AddRoundKey</a>, <a href="MixColumns_ES.html">MixColumns</a>, <a href="ShiftRows_ES.html">ShiftRows</a>, <a href="SubBytes_ES.html">SubBytes</a>, <a href="base64_ES.html">Base64</a>, <a href="ecb_ES.html">ECB</a>, <a href="cbc_ES.html">CBC</a>, <a href="Relleno_ES.html">Relleno</a>.



 </p>
</body>
</html>
