<meta HTTP-EQUIV="content-type" CONTENT="text/html; charset=UTF-8">
<html>


<head>


  <title>Mensajes de la comunicaci&#243;n cliente/servidor</title>
</head>
<body>

<h1>Descripci&#243;n de mensajes de la comunicaci&#243;n cliente/servidor</h1>
<p></p>
<p>Durante el proceso de ataque, en la pantalla del servidor o del cliente ir&#225;n apareciendo una serie de mensajes que describir&#225;n el progreso de la prueba de claves. A continuaci&#243;n se incluye el significado de los diferentes mensajes que pueden aparecer.<br></p>
<p><b>· <u>SERVIDOR</u></b><br><br>
- &quot;<i>x</i> claves a probar&quot;: indica el n&#250;mero <i>x</i> de claves que se probar&#225;n tras haber procedido a su c&#225;lculo.<br><br>
- &quot;Cliente <i>n</i>: <i>x</i> claves&quot;: indica el n&#250;mero <i>x</i> de claves que tendr&#225; que probar el cliente <i>n</i>.<br><br>
- &quot;Esperando conexi&#243;n...&quot;: el servidor ha comenzado a esperar las conexiones de los clientes. Esperar&#225; hasta haber conectado con todos los clientes que se le indicaron.<br><br>
- &quot;Conexi&#243;n establecida con el cliente <i>z</i>&quot;: se ha detectado correctamente el cliente <i>z</i>. <i>z</i> ser&#225; la direcci&#243;n del cliente expresada de la forma <i>&lt;nombre_cliente&gt;/&lt;dir_ip&gt;</i>.<br><br>
- &quot;Error al conectar con los clientes&quot;: el servidor no ha podido recibir las peticiones de los clientes o no ha podido comunicarse con ellos. Se seguir&#225; intentando la conexi&#243;n de todas maneras, por lo que es posible que este mensaje aparezca reiteradas veces si se ha dado alg&#250;n fallo en la comunicaci&#243;n. Si esto contin&#250;a ocurriendo puede ser debido a la red a trav&#233;s de la que se conecta con el cliente, a que el puerto que el servidor est&#225; usando est&#225; ocupado por otra aplicaci&#243;n o a un fallo puntual de p&#233;rdida de informaci&#243;n en la red. Se recomienda cerrar la ventana de los clientes que no se hayan conectado con el servidor y volver a lanzarlos. Reiniciar todo el proceso, tanto en servidor como en cliente, cerrando y volviendo a abrir la aplicaci&#243;n, tambi&#233;n puede solucionar el problema.<br><br>
- &quot;Clave <i>n</i>: <i>z</i>&quot;: indica la clave inicial <i>z</i> que se le enviar&#225; al cliente <i>n</i>. <i>z</i> ser&#225; la clave expresada en hexadecimal.<br><br>
- &quot;Enviando clave... &quot;: el servidor ha procedido a enviar la clave indicada.<br><br>
- &quot;Clave enviada&quot;: el servidor ha conseguido enviar correctamente la clave al cliente.<br><br>
- &quot;Error al enviar la clave&quot;: el servidor ha recibido una respuesta inesperada del cliente al enviar la clave. El proceso del cliente parar&#225; y el servidor intentar&#225; continuar con otro cliente. Esto ocurrir&#225; cuando otros clientes intenten conectarse al servidor una vez que este ha terminado de detectar todos los clientes con los que tienen que conectarse. Si no es el caso, entonces es que ha ocurrido alg&#250;n problema en la red, por lo que es recomendable reiniciar el proceso.<br><br>
- &quot;Enviando texto... &quot;: el servidor procede a enviar el texto en claro y cifrado al cliente.<br><br>
- &quot;Texto enviado&quot;: el servidor ha enviado correctamente los textos.<br><br>
- &quot;Error al enviar el texto&quot;: el servidor ha recibido una respuesta inesperada del cliente al enviar el texto. El proceso del cliente parar&#225; y el servidor intentar&#225; continuar con otro cliente. Esto ocurrir&#225; cuando otros clientes intenten conectarse al servidor una vez que este ha terminado de detectar todos los clientes con los que tienen que conectarse. Si no es el caso, entonces es que ha ocurrido alg&#250;n problema en la red, por lo que es recomendable reiniciar el proceso.<br><br>
- &quot;Generaci&#243;n de claves finalizada correctamente&quot;: la fase de generar las claves y distribuir los datos necesarios a los clientes ha terminado. Puede llegarse a este punto incluso aunque haya ocurrido alg&#250;n error, ya que el servidor intentar&#225; continuar aunque la comunicaci&#243;n con alg&#250;n cliente falle.<br><br>
- &quot;Comenzando cifrado en clientes&quot; y &quot;Buscando claves...&quot;: comienza la fase de la prueba de claves en los clientes. El servidor les avisa de que pueden comenzar a cifrar para intentar encontrar la clave.<br><br>
- &quot;El cliente <i>z</i> ha terminado&quot;: el proceso de b&#250;squeda de claves ha acabado en el cliente <i>z</i>. <i>z</i> ser&#225; la direcci&#243;n del cliente expresada de la forma <i>&lt;nombre_cliente&gt;/&lt;dir_ip&gt;</i>.<br><br>
- &quot;Cliente: <i>z</i>&quot; y &quot;Clave encontrada: <i>x</i>&quot;: el cliente <i>z</i> ha encontrado una clave <i>x</i> v&#225;lida para descifrar el mensaje y se la ha enviado al servidor. <i>z</i> ser&#225; la direcci&#243;n del cliente expresada de la forma <i>&lt;nombre_cliente&gt;/&lt;dir_ip&gt;</i>. <i>x</i> ser&#225; la clave expresada en hexadecimal.<br><br>
-&quot;B&#250;squeda de claves finalizada&quot; y &quot;<i>n</i> claves encontradas&quot;: todos los clientes han terminado el proceso de probar claves. Indica el total <i>n</i> de claves que se han encontrado entre todos ellos.<br><br>
- &quot;Error en la b&#250;squeda de claves&quot;: hubo un problema en la comunicaci&#243;n en red, por lo que se recomienda reiniciar el proceso. El servidor dejar&#225; de buscar claves, sin embargo los clientes continuar&#225;n, por lo que habr&#225; que cerrarlos para parar su ejecuci&#243;n. Hay que verificar que no haya clientes intentando conectarse una vez que el servidor haya detectado todos.<br><br>
- &quot;Fin del proceso&quot;: el servidor ha parado su ejecuci&#243;n, correcta o incorrectamente. No quedan m&#225;s operaciones pendientes.<br><br>

<p><b>· <u>CLIENTE</u></b><br><br>
- &quot;Conectando con el servidor...&quot;: el cliente intenta conectar con el servidor. Realizar&#225; 100 intentos de conexi&#243;n con 3 segundos de espacio entre cada una de ellas.<br><br>
- &quot;Conexi&#243;n establecida&quot;: el cliente se ha conectado correctamente al servidor.<br><br>
- &quot;Error al conectar con el servidor&quot;: ha habido un problema en la red o se han agotado el n&#250;mero de intentos de conexi&#243;n con el servidor. En cualquier caso, se recomienda cerrar y volver a abrir el cliente para reintentar la conexi&#243;n con el servidor.<br><br>
- &quot;Recibiendo clave inicial...&quot;: el cliente intenta recibir la clave inicial del servidor.<br><br>
- &quot;Clave recibida&quot;: el cliente ha recibido la clave correctamente.<br><br>
- &quot;Error al recibir la clave&quot;: ha habido un problema en la red. El cliente terminar&#225; su ejecuci&#243;n inmediatamente. Si el servidor se bloquea posteriormente, puede ser porque est&#233; esperando una respuesta de este cliente. En ese caso, se recomienda reiniciar el proceso.<br><br>
- &quot;Clave inicial <i>x</i>&quot;: indica la clave inicial <i>x</i> a partir de la cual comenzar&#225; a probar. <i>x</i> ser&#225; la clave expresada en hexadecimal.<br><br>
- &quot;N&#250;mero de claves a probar: <i>n</i>&quot;: indica el n&#250;mero <i>n</i> de claves a probar a partir de la clave inicial.<br><br>
- &quot;Recibiendo texto...&quot;: el cliente intenta recibir el texto en claro y el texto cifrado del servidor.<br><br>
- &quot;Texto recibido&quot;: el cliente ha recibido los textos correctamente.<br><br>
- &quot;Error al recibir el texto&quot;: ha habido un problema en la red. El cliente terminar&#225; su ejecuci&#243;n inmediatamente. Si el servidor se bloquea posteriormente, puede ser porque est&#233; esperando una respuesta de este cliente. En ese caso, se recomienda reiniciar el proceso.<br><br>
- &quot;Comenzando la prueba de claves...&quot;: el cliente ha recibido la orden de comenzar a probar claves, por lo que comenzar&#225; a cifrar en b&#250;squeda de la clave.<br><br>
- &quot;Clave encontrada: <i>x</i>&quot;: el cliente ha encontrado la clave <i>x</i> como v&#225;lida para descifrar el mensaje. <i>x</i> ser&#225; la clave expresada en hexadecimal.<br><br>
- &quot;Prueba de claves finalizada&quot;: el cliente ha terminado la prueba de todas las claves que se le hab&#237;an indicado correctamente.<br><br>
- &quot;Hubo un error al probar las claves&quot;: bien se ha encontrado una clave incorrecta o ha habido un problema en la red. En cualquier caso, el cliente dejar&#225; de probar claves y comunicar&#225; al servidor que ha terminado. Se recomienda comparar la clave inicial recibida por el cliente y la que env&#237;a el servidor para ver si coinciden. De no ser as&#237;, se trata de un error puntual en la red y un reintento del proceso deber&#237;a solucionar el problema.<br><br>
- &quot;Hubo un problema al comunicar al servidor que este cliente ha acabado&quot;: ha habido un problema de red cuando se intentaba comunicar al servidor el final del proceso. Si el servidor se bloquea posteriormente ser&#225; porque estar&#225; esperando este mensaje, as&#237; que habr&#225; que pararlo manualmente.<br><br>
- &quot;Fin del proceso&quot;: el cliente ha finalizado correcta o incorrectamente. No quedan m&#225;s operaciones pendientes.<br><br>
</body>
</html>
