<html>
<head>
	<title>Proceso de Cifrado</title>
</head>
<body>
	<h1>Proceso de Cifrado</h1>
	
	<p>El algoritmo AES (Advanced Encryption Standard) tiene un tama&ntilde;o fijo de bloque de 128 bits a la hora de cifrar. El tama&ntilde;o de la clave, sin embargo, puede ser de 128, 192 &oacute; 256 bits.<br><br>
	
El proceso de cifrado consta de un n&uacute;mero variable de rondas que depende exclusivamente del tama&ntilde;o de la clave, 10 rondas en caso de que la clave sea de 128 bits, 12 rondas para claves de 192 y por &uacute;ltimo 14 rondas para las de 256. <br><br>
AES opera sobre una matriz de 4x4 bytes, denominada state sobre la que va realizando las modificaciones pertinentes.<br><br>
El esquema del proceso es el siguiente: 
<p>1 - Expansi&oacute;n de la clave usando el esquema de claves de Rijndael.</p>
<p>2 - Etapa inicial: <br>
AddRoundKey </p>
<p>3 - Rondas:<br>
<a href="SubBytes.html">SubBytes</a> - Se realiza una sustituci&oacute;n no lineal donde cada byte es reemplazado con otro de acuerdo a una tabla de b&uacute;squeda.<br>
<a href="ShiftRows.html">ShiftRows</a> - En este paso se realiza una transposici&oacute;n donde cada fila del state es rotada de manera c&iacute;clica un n&uacute;mero determinado de veces.<br>
<a href="MixColumns.html">MixColumns</a> - operaci&oacute;n de mezclado que opera en las columnas del state, combinando los cuatro bytes en cada columna usando una transformaci&oacute;n lineal.<br>
<a href="AddRoundKey.html">AddRoundKey</a> - cada byte del state es combinado con la clave de ronda; cada clave de ronda se deriva de la clave de cifrado usando una iteraci&oacute;n de la clave.</p>
<p>4 - Etapa final, en la que se realizan las siguientes operaciones: <br>
SubBytes<br>
ShiftRows<br>
AddRoundKey <br></p>
		
	<p>El bloque 3 correspondiente a las rondas es el que se repite dependiendo del tama&ntilde;o de la clave. Para claves de 128 bits, donde el n&uacute;mero de rondas es 10, este bloque se repitir&iacute;a un total de 9 veces que m&aacute;s la ronda final (en la que no se realiza el proceso de MixColumns) dar&iacute;an las 10 rondas de las que habl&aacute;bamos. Para tama&ntilde;os de clave superiores, el recorrido ser&iacute;a an&aacute;logo.</p>


</body>
</html>
